
. tempfile temp;

. use ppp_rats_1993_2005;

. keep isocode rat;

. sort isocode;

. save `temp', replace;
(note: file /var/folders/38/c1zdglyj2pd5szj5dkc54zj00000gp/T//S_01067.000001 not f
> ound)
file /var/folders/38/c1zdglyj2pd5szj5dkc54zj00000gp/T//S_01067.000001 saved

. use ICP2011_WDI_compare;
(From 140410_ICP_WDI_comparisons.xlsx)

. sort isocode;

. by isocode: keep if _n==1;
(3 observations deleted)

. merge 1:1 isocode using `temp';
(note: variable isocode was str3, now str7 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            41
        from master                        37  (_merge==1)
        from using                          4  (_merge==2)

    matched                               146  (_merge==3)
    -----------------------------------------

. gen lnrat_11=log(rat_ICP_X);
(25 missing values generated)

. gen lnrat_05=log(rat);
(73 missing values generated)

. save `temp', replace;
file /var/folders/38/c1zdglyj2pd5szj5dkc54zj00000gp/T//S_01067.000001 saved

. keep if _m==3;
(41 observations deleted)

. drop if isocode=="MAC"|isocode=="ZMB"|isocode=="POL";
(3 observations deleted)

. regress lnrat_11 lnrat_05;

      Source |       SS           df       MS      Number of obs   =       106
-------------+----------------------------------   F(1, 104)       =     18.60
       Model |  .565851944         1  .565851944   Prob > F        =    0.0000
    Residual |  3.16395321       104  .030422627   R-squared       =    0.1517
-------------+----------------------------------   Adj R-squared   =    0.1436
       Total |  3.72980516       105  .035521954   Root MSE        =    .17442

------------------------------------------------------------------------------
    lnrat_11 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnrat_05 |  -.2485569   .0576332    -4.31   0.000    -.3628456   -.1342681
       _cons |  -.0892666   .0255174    -3.50   0.001    -.1398685   -.0386648
------------------------------------------------------------------------------

. predict x11;
(option xb assumed; fitted values)
(33 missing values generated)

. regress lnrat_11 lnrat_05, nocons;

      Source |       SS           df       MS      Number of obs   =       106
-------------+----------------------------------   F(1, 105)       =     98.39
       Model |  3.31353457         1  3.31353457   Prob > F        =    0.0000
    Residual |  3.53626238       105  .033678689   R-squared       =    0.4837
-------------+----------------------------------   Adj R-squared   =    0.4788
       Total |  6.84979695       106  .064620726   Root MSE        =    .18352

------------------------------------------------------------------------------
    lnrat_11 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnrat_05 |  -.3993281   .0402589    -9.92   0.000     -.479154   -.3195022
------------------------------------------------------------------------------

. predict x12;
(option xb assumed; fitted values)
(33 missing values generated)

. drop if region=="2005";
(2 observations deleted)

. preserve;

. drop if region=="CAR";
(11 observations deleted)

. drop if region=="SIG";
(2 observations deleted)

. table region, c(mean lnrat_05 mean lnrat_11 count lnrat_05 count lnrat_11), if l
> nrat_05~=. & lnrat_11~=.;

--------------------------------------------------------------------------
   region | mean(lnrat_05)  mean(lnrat_11)     N(lnrat_05)     N(lnrat_11)
----------+---------------------------------------------------------------
      AFR |       .5625677       -.2548112              33              33
      ASI |       .4635555       -.3439955              15              15
      CIS |       .4022397       -.1531452               5               5
      EUO |       .0802167       -.0002625              40              40
      LAT |        .260542       -.1256637               7               7
      WAS |       .4211167       -.5607108               5               5
--------------------------------------------------------------------------

. table region, c(sd lnrat_05 sd lnrat_11), if lnrat_05~=. & lnrat_11~=.;

--------------------------------------
   region | sd(lnrat_05)  sd(lnrat_11)
----------+---------------------------
      AFR |     .2735728      .1476354
      ASI |     .2652397      .0761186
      CIS |     .2367116      .2480896
      EUO |     .1203396      .0109695
      LAT |     .2062338      .0638882
      WAS |     .1377725       .115721
--------------------------------------

. restore;

. corr lnrat_11 lnrat_05;
(obs=106)

             | lnrat_11 lnrat_05
-------------+------------------
    lnrat_11 |   1.0000
    lnrat_05 |  -0.3895   1.0000


.         use `temp', clear;
(From 140410_ICP_WDI_comparisons.xlsx)

. table region, c(mean lnrat_05 mean lnrat_11 count lnrat_05 count lnrat_11), if l
> nrat_05~=. & lnrat_11~=.;

--------------------------------------------------------------------------
   region | mean(lnrat_05)  mean(lnrat_11)     N(lnrat_05)     N(lnrat_11)
----------+---------------------------------------------------------------
      AFR |       .5436422       -.0604769              34              34
      ASI |       .3755755       -.3415387              16              16
      CIS |       .4022397       -.1531452               5               5
      EUO |       .0216833       -.0002561              41              41
      LAT |        .260542       -.1256637               7               7
      SIG |       .4289682       -.1575599               1               1
      WAS |       .4211167       -.5607108               5               5
--------------------------------------------------------------------------

. table region, c(sd lnrat_05 sd lnrat_11), if lnrat_05~=. & lnrat_11~=.;

--------------------------------------
   region | sd(lnrat_05)  sd(lnrat_11)
----------+---------------------------
      AFR |     .2911222      1.142442
      ASI |     .4353273      .0741913
      CIS |     .2367116      .2480896
      EUO |     .3931822      .0108316
      LAT |     .2062338      .0638882
      SIG |                           
      WAS |     .1377725       .115721
--------------------------------------

.                 log close;
      name:  <unnamed>
       log:  /Users/deaton/Documents/ASD_files/itag/calcs_05_11/may_2014/revision/
> boston_final/tables/table_1.log
  log type:  text
 closed on:  28 May 2016, 08:42:21
----------------------------------------------------------------------------------
