----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/deaton/Documents/ASD_files/itag/calcs_05_11/may_2014/revision/
> boston_final/tables/tables_2_3.log
  log type:  text
 opened on:  28 May 2016, 08:54:07

. use icp_ring_cpi_xr;
(bettina_cpi_xr)

. keep isocode cpi_2011 cpi_2005;

. sort isocode;

. merge 1:1 isocode using world2011;

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                18  (_merge==3)
    -----------------------------------------

. keep if _m==3;
(0 observations deleted)

. drop _m;

. **converting currencies that changed using the official factors at time of Euro 
> adoption;
. local fix_EST=15.6466;

. local fix_SVN=239.640;

. replace xr2011=xr2011*`fix_EST' if isocode=="EST";
(1 real change made)

. replace xr2011=xr2011*`fix_SVN' if isocode=="SVN";
(1 real change made)

. gen pli2011=ppp_uk/xr2011;

. gen pli2005=ppp_uk2005/xr2005;

. **First redoing the original analysis;
. **which has GBR as numeraire, renormalized in Table 2 to be the ring as a whole
> 
> gen dlncpi_icp=log(pli2011/pli2005)+log(xr2011/xr2005);
. gen dlncpi=log(cpi_2011/cpi_2005);

. gen ppp2005_table=ppp_uk2005;

. gen ppp2011_table=ppp_uk;

. list isocode ppp2005_table ppp2011_table xr2005 xr2011 dlncpi;

     +-----------------------------------------------------------------+
     | isocode   ppp200~e   ppp201~e     xr2005     xr2011      dlncpi |
     |-----------------------------------------------------------------|
  1. |     BRA   2.800647   2.719921   4.418182   2.679471    .2926696 |
  2. |     CHL     684.08    640.957   1018.345   780.8253    .0468836 |
  3. |     CMR   649.7866   404.1992   959.0363   755.8156    .1823216 |
  4. |     EGY   3.570344   3.275088   10.50909   9.469756     .644482 |
  5. |     EST   15.50747   .8718485   22.87273   18.01963    .2829207 |
     |-----------------------------------------------------------------|
  6. |     GBR          1   1.000004          1          1    .1789826 |
  7. |     HKG   9.764152    9.12831   14.14545   12.46809    .1621188 |
  8. |     JOR   .6786367    .532931   1.290909   1.137249    .3371863 |
  9. |     JPN   218.2265   160.3656      200.4   127.8315   -.0070246 |
 10. |     KEN   64.80407   61.76859   137.3636   142.2534    .7193022 |
     |-----------------------------------------------------------------|
 11. |     LKA   80.18299   75.05579   182.7273   177.0988    .6054083 |
 12. |     MYS    3.67513   2.478744   6.890909   4.901386    .1629688 |
 13. |     OMN   .3392712   .2916689   .6909091   .6158761    .3133498 |
 14. |     PHL   39.71505   31.49042   100.1636   69.37719    .2851789 |
 15. |     SEN    604.321   439.9288   959.0363   755.8156    .1697428 |
     |-----------------------------------------------------------------|
 16. |     SVN   287.1781   1.053165   350.2727   275.9849    .1595646 |
 17. |     ZAF   7.735208   8.132281   11.56364   11.63057    .3852624 |
 18. |     ZMB   5235.325   4111.048   8115.455   7785.614    .5743637 |
     +-----------------------------------------------------------------+

. summ dlncpi if isocode=="GBR";

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      dlncpi |          1    .1789826           .   .1789826   .1789826

. replace dlncpi=dlncpi-r(mean);
(18 real changes made)

. gen lnppp2011=log(ppp2011_table);

. gen lnppp2005=log(ppp2005_table);

. **converting currencies that changed;
. replace lnppp2011=lnppp2011+log(15.6466) if isocode=="EST";
(1 real change made)

. replace lnppp2011=lnppp2011+log(239.640) if isocode=="SVN";
(1 real change made)

. gen dlnppp=lnppp2011-lnppp2005;

. gen dlnp_icp=dlnppp;

. gen c_key=0;

. replace c_key=1 if isocode=="JPN"|isocode=="CHL"|isocode=="HKG"|isocode=="GBR"|i
> socode=="BRA"|isocode=="ZAF"|
>         isocode=="EST"|isocode=="SVN";
(8 real changes made)

. table isocode, c(mean c_key);

-----------------------
  isocode | mean(c_key)
----------+------------
      BRA |           1
      CHL |           1
      CMR |           0
      EGY |           0
      EST |           1
      GBR |           1
      HKG |           1
      JOR |           0
      JPN |           1
      KEN |           0
      LKA |           0
      MYS |           0
      OMN |           0
      PHL |           0
      SEN |           0
      SVN |           1
      ZAF |           1
      ZMB |           0
-----------------------

. regress dlnp_icp dlncpi if c_key==1;

      Source |       SS           df       MS      Number of obs   =         8
-------------+----------------------------------   F(1, 6)         =      5.69
       Model |  .040342757         1  .040342757   Prob > F        =    0.0543
    Residual |  .042519618         6  .007086603   R-squared       =    0.4869
-------------+----------------------------------   Adj R-squared   =    0.4013
       Total |  .082862375         7  .011837482   Root MSE        =    .08418

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5837591   .2446639     2.39   0.054    -.0149119     1.18243
       _cons |  -.0897081   .0298387    -3.01   0.024    -.1627206   -.0166955
------------------------------------------------------------------------------

. predict phat1;
(option xb assumed; fitted values)

. regress dlnp_icp dlncpi if c_key==0;

      Source |       SS           df       MS      Number of obs   =        10
-------------+----------------------------------   F(1, 8)         =     19.59
       Model |  .128737676         1  .128737676   Prob > F        =    0.0022
    Residual |  .052575433         8  .006571929   R-squared       =    0.7100
-------------+----------------------------------   Adj R-squared   =    0.6738
       Total |  .181313109         9  .020145901   Root MSE        =    .08107

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5566034   .1257591     4.43   0.002     .2666024    .8466044
       _cons |  -.3480128   .0377594    -9.22   0.000    -.4350863   -.2609394
------------------------------------------------------------------------------

. predict phat0;
(option xb assumed; fitted values)

. gen dhat=phat1-phat0;

. summ dhat;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dhat |         18    .2617354    .0056397   .2532536   .2729776

. drop phat1 phat0 dhat;

. regress dlnp_icp dlncpi i.c_key;

      Source |       SS           df       MS      Number of obs   =        18
-------------+----------------------------------   F(2, 15)        =     20.25
       Model |  .256966127         2  .128483063   Prob > F        =    0.0001
    Residual |  .095162996        15    .0063442   R-squared       =    0.7297
-------------+----------------------------------   Adj R-squared   =    0.6937
       Total |  .352129123        17  .020713478   Root MSE        =    .07965

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5626245   .1090053     5.16   0.000     .3302852    .7949638
     1.c_key |   .2598158   .0442748     5.87   0.000     .1654462    .3541853
       _cons |  -.3493402   .0348118   -10.04   0.000    -.4235397   -.2751406
------------------------------------------------------------------------------

. replace c_key=0 if isocode=="ZAF";
(1 real change made)

. regress dlnp_icp dlncpi if c_key==1;

      Source |       SS           df       MS      Number of obs   =         7
-------------+----------------------------------   F(1, 5)         =      2.43
       Model |  .020295044         1  .020295044   Prob > F        =    0.1801
    Residual |  .041832912         5  .008366582   R-squared       =    0.3267
-------------+----------------------------------   Adj R-squared   =    0.1920
       Total |  .062127956         6  .010354659   Root MSE        =    .09147

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5245254   .3367794     1.56   0.180    -.3411937    1.390244
       _cons |  -.0936296   .0351926    -2.66   0.045    -.1840951   -.0031641
------------------------------------------------------------------------------

. predict phat1;
(option xb assumed; fitted values)

. regress dlnp_icp dlncpi if c_key==0;

      Source |       SS           df       MS      Number of obs   =        11
-------------+----------------------------------   F(1, 9)         =      8.95
       Model |  .124764865         1  .124764865   Prob > F        =    0.0152
    Residual |  .125483335         9  .013942593   R-squared       =    0.4986
-------------+----------------------------------   Adj R-squared   =    0.4428
       Total |    .2502482        10   .02502482   Root MSE        =    .11808

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5478275   .1831342     2.99   0.015     .1335492    .9621058
       _cons |   -.320339   .0536505    -5.97   0.000    -.4417049   -.1989731
------------------------------------------------------------------------------

. predict phat0;
(option xb assumed; fitted values)

. gen dhat=phat1-phat0;

. summ dhat;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        dhat |         18    .2237656    .0048394   .2141188   .2310438

. drop phat1 phat0 dhat;

. **Regression results appear in Table 3;
. regress dlnp_icp dlncpi i.c_key;

      Source |       SS           df       MS      Number of obs   =        18
-------------+----------------------------------   F(2, 15)        =      8.28
       Model |  .184778858         2  .092389429   Prob > F        =    0.0038
    Residual |  .167350265        15  .011156684   R-squared       =    0.5247
-------------+----------------------------------   Adj R-squared   =    0.4614
       Total |  .352129123        17  .020713478   Root MSE        =    .10563

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5443158   .1509718     3.61   0.003     .2225271    .8661046
     1.c_key |   .2263265   .0625035     3.62   0.003     .0931034    .3595496
       _cons |  -.3195694   .0459237    -6.96   0.000    -.4174535   -.2216852
------------------------------------------------------------------------------

. regress dlnp_icp dlncpi if isocode=="JPN"|isocode=="CHL"|isocode=="HKG"|isocode=
> ="GBR"|isocode=="BRA"|
>         isocode=="ZAF"|isocode=="EST"|isocode=="SVN";

      Source |       SS           df       MS      Number of obs   =         8
-------------+----------------------------------   F(1, 6)         =      5.69
       Model |  .040342757         1  .040342757   Prob > F        =    0.0543
    Residual |  .042519618         6  .007086603   R-squared       =    0.4869
-------------+----------------------------------   Adj R-squared   =    0.4013
       Total |  .082862375         7  .011837482   Root MSE        =    .08418

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5837591   .2446639     2.39   0.054    -.0149119     1.18243
       _cons |  -.0897081   .0298387    -3.01   0.024    -.1627206   -.0166955
------------------------------------------------------------------------------

. matrix b=e(b);

. gen p_hat_1=b[1,1]*dlncpi+b[1,2];

. regress dlnp_icp dlncpi if isocode~="JPN"&isocode~="CHL"&isocode~="HKG"&isocode~
> ="GBR"&isocode~="BRA"
>         &isocode~="ZAF"&isocode~="EST"&isocode~="SVN";

      Source |       SS           df       MS      Number of obs   =        10
-------------+----------------------------------   F(1, 8)         =     19.59
       Model |  .128737676         1  .128737676   Prob > F        =    0.0022
    Residual |  .052575433         8  .006571929   R-squared       =    0.7100
-------------+----------------------------------   Adj R-squared   =    0.6738
       Total |  .181313109         9  .020145901   Root MSE        =    .08107

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5566034   .1257591     4.43   0.002     .2666024    .8466044
       _cons |  -.3480128   .0377594    -9.22   0.000    -.4350863   -.2609394
------------------------------------------------------------------------------

. matrix b=e(b);

. gen p_hat_2=b[1,1]*dlncpi+b[1,2];

. replace p_hat_1=. if dlncpi >=0.5;
(1 real change made, 1 to missing)

. gen ccd=2;

. replace ccd=1 if isocode=="JPN"|isocode=="CHL"|isocode=="HKG"|isocode=="GBR"|iso
> code=="BRA"|isocode=="ZAF"|isocode=="EST"|isocode=="SVN";
(8 real changes made)

. regress dlnp_icp dlncpi i.ccd;

      Source |       SS           df       MS      Number of obs   =        18
-------------+----------------------------------   F(2, 15)        =     20.25
       Model |  .256966127         2  .128483063   Prob > F        =    0.0001
    Residual |  .095162996        15    .0063442   R-squared       =    0.7297
-------------+----------------------------------   Adj R-squared   =    0.6937
       Total |  .352129123        17  .020713478   Root MSE        =    .07965

------------------------------------------------------------------------------
    dlnp_icp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dlncpi |   .5626245   .1090053     5.16   0.000     .3302852    .7949638
       2.ccd |  -.2598158   .0442748    -5.87   0.000    -.3541853   -.1654462
       _cons |  -.0895244   .0281766    -3.18   0.006    -.1495815   -.0294674
------------------------------------------------------------------------------

. log close;
      name:  <unnamed>
       log:  /Users/deaton/Documents/ASD_files/itag/calcs_05_11/may_2014/revision/
> boston_final/tables/tables_2_3.log
  log type:  text
 closed on:  28 May 2016, 08:54:10
----------------------------------------------------------------------------------
